InformationRegisters/ТехнологическийЖурнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТехнологическийЖурнал</Name>
			<Comment>Служебный журнал для протоколирования событий</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТехнологическийЖурнал/Ext/ManagerModule.bsl
Процедура ЗаписатьСобытие(Событие, Данные) Экспорт
	
	//Если ИД=Неопределено Тогда
	//	ИД = Строка(Новый УникальныйИдентификатор);  // по идентифкатору не выстраивается корректсная сортировка
	//КонецЕсли;
	
	Порядок = 1;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТехнологическийЖурнал.Порядок) КАК Порядок
	|ИЗ
	|	РегистрСведений.ТехнологическийЖурнал КАК ТехнологическийЖурнал
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТехнологическийЖурнал.Порядок) > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Порядок = Выборка.Порядок + 1;
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ТехнологическийЖурнал.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 		= ТекущаяДатаСеанса();
		МенеджерЗаписи.Порядок 		= Порядок;
		МенеджерЗаписи.Событие 		= Событие;
		МенеджерЗаписи.Данные 		= Данные;		
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
